#+LaTeX_CLASS: beamer
#+BEAMER_THEME: Pittsburgh
#+BEAMER_COLOR_THEME: seahorse
#+OPTIONS: H:2 toc:1
#+TITLE: Literate Programming with Org Mode
#+AUTHOR: Josh Holbrook
#+DATE: August 2020

** Org-Babel? Code Execution?
- Org supports inline "blocks", including "source blocks"
- Org-babel adds slick features around these blocks
- For example, we can execute this block of Emacs lisp with ~C-c C-c~
- We can *edit* it with ~C-c '~

#+BEGIN_SRC emacs-lisp
(message "hello world!")
#+END_SRC

#+RESULTS:
: hello world!

** Once It's Running We Can Curl It
This you CAN run with ~C-c C-c~:

#+BEGIN_SRC bash :results drawer
curl localhost:8080
#+END_SRC

#+RESULTS:
:results:
<html>
    <head>
      <title>HELLO EMACS NYC!</title>
    </head>
    <body>
      <h1>HELLO EMACS NYC!</h1>
    </body>
  </html>
:end:
